assignments/assignment1/a1.tex
% Created 2021-02-07 Sun 16:50
% Intended LaTeX compiler: pdflatex
\documentclass[letterpaper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Arun Woosaree}
\date{\today}
\title{ECE 420 Assignment 1}
\hypersetup{
 pdfauthor={Arun Woosaree},
 pdftitle={ECE 420 Assignment 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Flynn's Taxonomy}
\label{sec:org0d354b8}
\subsection{SISD}
\label{sec:orgff2e8bc}
SISD stands for Single Instruction Stream, Single Data Stream. A SISD system has a single uniprocessor, which executes a single instruction stream to operate on data stored in a single.

An example that would fit in this category is a single core superscalar processor like the AMD 29050
Reference: \url{https://en.wikipedia.org/wiki/Superscalar\_processor}

\subsection{SIMD}
\label{sec:orgccb20ca}
SIMD stands for Single Instruction Stream, Multiple Data Stream. A SIMD system has multiple processing units which all simultaneously do the same operation on multiple points in a data pool in a synchronized fashion.

An example that would fit in this category is a modern graphics processing unit, like the AMD Radeon 6900 XT

\subsection{MISD}
\label{sec:org49977a4}
MISD stands for Multiple Instruction Stream, Single Data Stream. A MISD system has multiple processing units performing different operations on the same data simultaneously. It can be used for reliability or fault tolerance, if the same operation is being done multiple times on the same data.

An example of an MISD system is the computer responsible for the Space Shuttle flight control. The Space Shuttle is also known as the low orbit spacecraft that helped launch the Hubble telescope, among other space missions.
References: \url{https://en.wikipedia.org/wiki/MISD\#cite\_note-1} \url{https://en.wikipedia.org/wiki/Space\_Shuttle}

\subsection{MIMD}
\label{sec:org4b911dc}
MIMD stands for Multiple Instruction Stream, Multiple Data Stream. A MIMD system has many processing units which each perform operations independently from each other at the same time. That is, each unit can be doing different operations on different pieces of data at any given time.

An example of a MIMD system is almost any modern multicore processor, like the AMD Ryzen 9 5950X.
Another example could be a computer cluster, or a network of workstations.

\section{Shared Memory vs Distributed Memory}
\label{sec:org45e3b88}
\subsection{Shared Memory}
\label{sec:org84024cc}
\subsubsection{Pros}
\label{sec:orgb1350c1}
\begin{itemize}
\item user friendly programming perspective to memory
\item data sharing between tasks is fast and uniform
\end{itemize}
\subsubsection{Cons}
\label{sec:org79802db}
\begin{itemize}
\item no scalability between memory and CPUs
\item if you want more power,
\end{itemize}
\subsection{Distributed Memory}
\label{sec:org3f87b7c}
\subsubsection{Pros}
\label{sec:org790fb19}
\begin{itemize}
\item memory is scalable with the number of processors
\item this is cost effective, because lots of cheap, commodity hardware can be used as opposed to upgrading a monolithic, more expensive structure
\end{itemize}
\subsubsection{Cons}
\label{sec:org5bce5e7}
\begin{itemize}
\item data communication between processors is more difficult
\item it is difficult to map existing data structures to the memory organization
\item memory access times can be very different. For example, local access times vs over a network
access times can be much slower compared to a MIMD system
\item more overhead for the programmer. The programmer has to think about message passing
\end{itemize}
\end{document}
